@props([
  'size' => 24,      // 表示サイズ(px)
  'stroke' => 2,     // 線の太さ
])

<svg
  xmlns="http://www.w3.org/2000/svg"
  viewBox="0 0 40 40"
  fill="none"
  stroke="currentColor"
  stroke-width="{{ $stroke }}"
  stroke-linecap="round"
  stroke-linejoin="round"
  width="{{ $size }}"
  height="{{ $size }}"
  {{ $attributes->merge(['class' => 'inline-block shrink-0']) }}
>
  <path d="M11.6667 2.91699V8.75033M23.3333 2.91699V8.75033M30.625 20.417V8.75033C30.625 7.97678 30.3177 7.23491 29.7707 6.68793C29.2237 6.14095 28.4819 5.83366 27.7083 5.83366H7.29167C6.51812 5.83366 5.77625 6.14095 5.22927 6.68793C4.68229 7.23491 4.375 7.97678 4.375 8.75033V29.167C4.375 29.9405 4.68229 30.6824 5.22927 31.2294C5.77625 31.7764 6.51812 32.0837 7.29167 32.0837H18.9583M4.375 14.5837H30.625M23.3333 29.167L26.25 32.0837L32.0833 26.2503"  />
</svg>

